Hi @neil-yechenwei, Thank you for your response.
The issue occurs when you're trying to change firewall configuration from `selected-networks` -> `all-networks`.

TerminalOutputs:
- Creating new SA (`var.enable_firewall_rules` == `false`)
```bash
>$ terraform plan            
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "my_awersome_rg_name"
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "westeurope"
      + min_tls_version                  = "TLS1_0"
      + name                             = "satest01abc"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "my_awersome_rg_name"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```
PIC: 
![Screenshot from 2020-09-08 12-44-22](https://user-images.githubusercontent.com/67150725/92466999-35b90c00-f1d1-11ea-8dcf-de4a134209fa.png)


- Changing `var.enable_firewall_rules` from `false` to `true`
```bash
>$ terraform apply -var='enable_firewall_rules=true'     
azurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/deadbeef-dead-dead-dead-deaddeadbeef/resourceGroups/my_awersome_rg_name]
azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/deadbeef-dead-dead-dead-deaddeadbeef/resourceGroups/my_awersome_rg_name/providers/Microsoft.Storage/storageAccounts/satest01abc]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        access_tier                    = "Hot"
        account_kind                   = "StorageV2"
        account_replication_type       = "GRS"
        account_tier                   = "Standard"
        allow_blob_public_access       = false
        enable_https_traffic_only      = true
        id                             = "/subscriptions/deadbeef-dead-dead-dead-deaddeadbeef/resourceGroups/my_awersome_rg_name/providers/Microsoft.Storage/storageAccounts/satest01abc"
        is_hns_enabled                 = false
        location                       = "westeurope"
        min_tls_version                = "TLS1_0"
        name                           = "satest01abc"
        primary_access_key             = (sensitive value)
        primary_blob_connection_string = (sensitive value)
        primary_blob_endpoint          = "https://satest01abc.blob.core.windows.net/"
        primary_blob_host              = "satest01abc.blob.core.windows.net"
        primary_connection_string      = (sensitive value)
        primary_dfs_endpoint           = "https://satest01abc.dfs.core.windows.net/"
        primary_dfs_host               = "satest01abc.dfs.core.windows.net"
        primary_file_endpoint          = "https://satest01abc.file.core.windows.net/"
        primary_file_host              = "satest01abc.file.core.windows.net"
        primary_location               = "westeurope"
        primary_queue_endpoint         = "https://satest01abc.queue.core.windows.net/"
        primary_queue_host             = "satest01abc.queue.core.windows.net"
        primary_table_endpoint         = "https://satest01abc.table.core.windows.net/"
        primary_table_host             = "satest01abc.table.core.windows.net"
        primary_web_endpoint           = "https://satest01abc.z6.web.core.windows.net/"
        primary_web_host               = "satest01abc.z6.web.core.windows.net"
        resource_group_name            = "my_awersome_rg_name"
        secondary_access_key           = (sensitive value)
        secondary_connection_string    = (sensitive value)
        secondary_location             = "northeurope"
        tags                           = {}

      ~ network_rules {
            bypass                     = [
                "AzureServices",
            ]
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              + "127.0.0.1",
            ]
            virtual_network_subnet_ids = []
        }

        queue_properties {

            hour_metrics {
                enabled               = true
                include_apis          = true
                retention_policy_days = 7
                version               = "1.0"
            }

            logging {
                delete                = false
                read                  = false
                retention_policy_days = 0
                version               = "1.0"
                write                 = false
            }

            minute_metrics {
                enabled               = false
                include_apis          = false
                retention_policy_days = 0
                version               = "1.0"
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
```

PIC:
![Screenshot from 2020-09-08 12-49-07_pixelized](https://user-images.githubusercontent.com/67150725/92468005-c3e1c200-f1d2-11ea-8441-adad69d6059d.png)


- Changing `var.enable_firewall_rules` from `true` to `false`
```bash
>$ terraform apply                                  
azurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/deadbeef-dead-dead-dead-deaddeadbeef/resourceGroups/my_awersome_rg_name]
azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/deadbeef-dead-dead-dead-deaddeadbeef/resourceGroups/my_awersome_rg_name/providers/Microsoft.Storage/storageAccounts/satest01abc]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

Here comes trouble